; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	satellite4 - satellite
	instrument10 - instrument
	thermograph1 - mode
	spectrograph2 - mode
	infrared3 - mode
	thermograph0 - mode
	GroundStation4 - direction
	GroundStation8 - direction
	Star3 - direction
	Star6 - direction
	GroundStation1 - direction
	Star5 - direction
	Star9 - direction
	GroundStation7 - direction
	GroundStation10 - direction
	GroundStation0 - direction
	GroundStation2 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
	Star13 - direction
	Star14 - direction
	Star15 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 GroundStation8)
	(calibration_target instrument0 GroundStation4)
	(supports instrument1 thermograph0)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 GroundStation1)
	(calibration_target instrument1 Star5)
	(calibration_target instrument1 Star3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation10)
	(supports instrument2 thermograph0)
	(supports instrument2 spectrograph2)
	(calibration_target instrument2 Star5)
	(calibration_target instrument2 GroundStation1)
	(calibration_target instrument2 GroundStation2)
	(supports instrument3 spectrograph2)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 Star9)
	(calibration_target instrument3 Star5)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star13)
	(supports instrument4 spectrograph2)
	(supports instrument4 thermograph0)
	(supports instrument4 infrared3)
	(calibration_target instrument4 Star5)
	(supports instrument5 thermograph1)
	(calibration_target instrument5 Star9)
	(calibration_target instrument5 Star6)
	(supports instrument6 thermograph0)
	(supports instrument6 thermograph1)
	(calibration_target instrument6 GroundStation1)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation4)
	(supports instrument7 infrared3)
	(supports instrument7 thermograph1)
	(calibration_target instrument7 GroundStation1)
	(supports instrument8 spectrograph2)
	(supports instrument8 infrared3)
	(calibration_target instrument8 Star9)
	(calibration_target instrument8 Star5)
	(supports instrument9 spectrograph2)
	(supports instrument9 infrared3)
	(calibration_target instrument9 GroundStation7)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star5)
	(supports instrument10 thermograph1)
	(supports instrument10 thermograph0)
	(supports instrument10 spectrograph2)
	(calibration_target instrument10 GroundStation2)
	(calibration_target instrument10 GroundStation0)
	(calibration_target instrument10 GroundStation10)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation10)
)
(:goal (and
	(pointing satellite0 GroundStation10)
	(pointing satellite2 GroundStation2)
	(have_image Phenomenon11 thermograph1)
	(have_image Phenomenon12 thermograph1)
	(have_image Star13 spectrograph2)
	(have_image Star14 spectrograph2)
	(have_image Star15 thermograph1)
))

)

; plan
1. (switch_on instrument10 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument10)
   goals met: 1 of 7
2. (calibrate satellite4 instrument10 groundstation10)
   added: (calibrated instrument10)
   goals met: 1 of 7
3. (turn_to satellite4 star13 groundstation10)
   deleted: (pointing satellite4 groundstation10)
   added: (pointing satellite4 star13)
   goals met: 1 of 7
4. (take_image satellite4 star13 instrument10 spectrograph2)
   added: (have_image star13 spectrograph2)
   goals met: 2 of 7
5. (turn_to satellite4 phenomenon12 star13)
   deleted: (pointing satellite4 star13)
   added: (pointing satellite4 phenomenon12)
   goals met: 2 of 7
6. (take_image satellite4 phenomenon12 instrument10 thermograph1)
   added: (have_image phenomenon12 thermograph1)
   goals met: 3 of 7
7. (turn_to satellite4 phenomenon11 phenomenon12)
   deleted: (pointing satellite4 phenomenon12)
   added: (pointing satellite4 phenomenon11)
   goals met: 3 of 7
8. (take_image satellite4 phenomenon11 instrument10 thermograph1)
   added: (have_image phenomenon11 thermograph1)
   goals met: 4 of 7
9. (turn_to satellite2 groundstation2 groundstation4)
   deleted: (pointing satellite2 groundstation4)
   added: (pointing satellite2 groundstation2)
   goals met: 5 of 7
10. (turn_to satellite4 star14 phenomenon11)
   deleted: (pointing satellite4 phenomenon11)
   added: (pointing satellite4 star14)
   goals met: 5 of 7
11. (take_image satellite4 star14 instrument10 spectrograph2)
   added: (have_image star14 spectrograph2)
   goals met: 6 of 7
12. (turn_to satellite4 star15 star14)
   deleted: (pointing satellite4 star14)
   added: (pointing satellite4 star15)
   goals met: 6 of 7
13. (take_image satellite4 star15 instrument10 thermograph1)
   added: (have_image star15 thermograph1)
   goals met: 7 of 7
